Конфигурация/InformationRegisters/СтратегииИндивидуальногоИнвестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтратегииИндивидуальногоИнвестирования</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стратегия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтратегииИндивидуальногоИнвестирования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СтратегииИндивидуальногоИнвестирования/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Стратегия.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивДоступныхСтратегий(Запись.СчетДоверительногоУправления));
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	Элементы.Стратегия.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивДоступныхСтратегий(Запись.СчетДоверительногоУправления));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивДоступныхСтратегий(СчетДоверительногоУправления)
	
	Возврат РегистрыСведений.СтратегииИндивидуальногоИнвестирования.ПолучитьМассивДоступныхСтратегий(СчетДоверительногоУправления);
	
КонецФункции
